# DuctPipeModified Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures..::..DuctPipeModified Property
BuiltInFailures..::..PipingFailures Class See Also
---
The duct/pipe has been modified to be in the opposite direction causing the connections to be invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuctPipeModified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuctPipeModified As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuctPipeModified {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PipingFailures Class
Autodesk.Revit.DB Namespace